
## Plan Result (prod)




<pre><code>Plan: 17 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_communication_service.acs[0]
  * azurerm_key_vault_secret.acs_connection_string[0]
  * azurerm_log_analytics_workspace.logic_app_workspace[0]
  * azurerm_logic_app_action_custom.acs_email_connection[0]
  * azurerm_logic_app_action_custom.azure_monitor_connection[0]
  * azurerm_logic_app_action_custom.run_kql_query[0]
  * azurerm_logic_app_action_custom.send_email[0]
  * azurerm_logic_app_action_custom.welsh_acs_email_connection[0]
  * azurerm_logic_app_action_custom.welsh_azure_monitor_connection[0]
  * azurerm_logic_app_action_custom.welsh_kql_query[0]
  * azurerm_logic_app_action_custom.welsh_send_email[0]
  * azurerm_logic_app_trigger_recurrence.monthly_trigger[0]
  * azurerm_logic_app_trigger_recurrence.welsh_monthly_trigger[0]
  * azurerm_logic_app_workflow.kql_report_workflow[0]
  * azurerm_logic_app_workflow.welsh_report_workflow[0]
  * azurerm_role_assignment.logic_app_log_analytics_reader[0]
  * azurerm_role_assignment.welsh_logic_app_log_analytics_reader[0]
* Update
  * module.redis6-cache.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_communication_service.acs[0] will be created
  + resource "azurerm_communication_service" "acs" {
      + data_location               = "UK"
      + hostname                    = (known after apply)
      + id                          = (known after apply)
      + name                        = "xui-webapp-acs-prod"
      + primary_connection_string   = (sensitive value)
      + primary_key                 = (sensitive value)
      + resource_group_name         = "xui-webapp-prod"
      + secondary_connection_string = (sensitive value)
      + secondary_key               = (sensitive value)
    }

  # azurerm_key_vault_secret.acs_connection_string[0] will be created
  + resource "azurerm_key_vault_secret" "acs_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpx-prod/providers/Microsoft.KeyVault/vaults/rpx-prod"
      + name                    = "acs-email-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_log_analytics_workspace.logic_app_workspace[0] will be created
  + resource "azurerm_log_analytics_workspace" "logic_app_workspace" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "uksouth"
      + name                            = "xui-webapp-law-prod"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "xui-webapp-prod"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "application"         = "expert-ui"
          + "builtFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "production"
          + "managedBy"           = "Expert UI"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_logic_app_action_custom.acs_email_connection[0] will be created
  + resource "azurerm_logic_app_action_custom" "acs_email_connection" {
      + body         = (sensitive value)
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + name         = "acs-email-connection"
    }

  # azurerm_logic_app_action_custom.azure_monitor_connection[0] will be created
  + resource "azurerm_logic_app_action_custom" "azure_monitor_connection" {
      + body         = jsonencode(
            {
              + inputs = {
                  + api             = {
                      + id = "[concat(subscription().id, '/providers/Microsoft.Web/locations/', parameters('location'), '/managedApis/', 'azuremonitorlogs')]"
                    }
                  + name            = "azuremonitorlogs"
                  + parameterValues = {
                      + token = {
                          + value = "Bearer @{listCallbackUrl()}"
                        }
                    }
                }
              + type   = "ApiConnection"
            }
        )
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + name         = "azure-monitor-connection"
    }

  # azurerm_logic_app_action_custom.run_kql_query[0] will be created
  + resource "azurerm_logic_app_action_custom" "run_kql_query" {
      + body         = jsonencode(
            {
              + inputs   = {
                  + body    = jsonencode(
                        {
                          + query = "requests | where timestamp > ago(30d) | summarize count() by bin(timestamp, 1d) | render columnchart"
                        }
                    )
                  + host    = {
                      + connection = {
                          + name = "@parameters('$connections')['azuremonitorlogs']['connectionId']"
                        }
                    }
                  + method  = "post"
                  + path    = "/queryData"
                  + queries = {
                      + resourcegroups = "[parameters('resourceGroups')]"
                      + resourcename   = "[parameters('workspaceName')]"
                      + resourcetype   = "Log Analytics Workspace"
                      + subscriptions  = "[parameters('subscriptionId')]"
                      + timerange      = "Last 30 days"
                    }
                }
              + metadata = {
                  + flowSystemMetadata = {
                      + swaggerOperationId = "QueryData"
                    }
                }
              + type     = "ApiConnection"
            }
        )
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + name         = "run-kql-query"
    }

  # azurerm_logic_app_action_custom.send_email[0] will be created
  + resource "azurerm_logic_app_action_custom" "send_email" {
      + body         = jsonencode(
            {
              + inputs   = {
                  + body   = {
                      + attachments = [
                          + {
                              + contentBytes = "@body('run-kql-query')?['AttachmentContent']"
                              + contentType  = "image/png"
                              + name         = "@body('run-kql-query')?['AttachmentName']"
                            },
                        ]
                      + body        = {
                          + content     = "<p>Please find attached the monthly KQL report for xui in prod environment.</p><p>Query executed: requests | where timestamp > ago(30d) | summarize count() by bin(timestamp, 1d) | render columnchart</p>"
                          + contentType = "HTML"
                        }
                      + subject     = "Monthly KQL Report - xui prod"
                      + to          = "[split(body('run-kql-query')?['emailRecipients'], ',')]"
                    }
                  + host   = {
                      + connection = {
                          + name = "@parameters('$connections')['azurecommunicationservices']['connectionId']"
                        }
                    }
                  + method = "post"
                  + path   = "/emails:send"
                }
              + metadata = {
                  + flowSystemMetadata = {
                      + swaggerOperationId = "SendEmail"
                    }
                }
              + type     = "ApiConnection"
            }
        )
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + name         = "send-email"
    }

  # azurerm_logic_app_action_custom.welsh_acs_email_connection[0] will be created
  + resource "azurerm_logic_app_action_custom" "welsh_acs_email_connection" {
      + body         = (sensitive value)
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + name         = "welsh-acs-email-connection"
    }

  # azurerm_logic_app_action_custom.welsh_azure_monitor_connection[0] will be created
  + resource "azurerm_logic_app_action_custom" "welsh_azure_monitor_connection" {
      + body         = jsonencode(
            {
              + inputs = {
                  + api             = {
                      + id = "[concat(subscription().id, '/providers/Microsoft.Web/locations/', parameters('location'), '/managedApis/', 'azuremonitorlogs')]"
                    }
                  + name            = "azuremonitorlogs"
                  + parameterValues = {
                      + token = {
                          + value = "Bearer @{listCallbackUrl()}"
                        }
                    }
                }
              + type   = "ApiConnection"
            }
        )
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + name         = "welsh-azure-monitor-connection"
    }

  # azurerm_logic_app_action_custom.welsh_kql_query[0] will be created
  + resource "azurerm_logic_app_action_custom" "welsh_kql_query" {
      + body         = (known after apply)
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + name         = "run-welsh-kql-query"
    }

  # azurerm_logic_app_action_custom.welsh_send_email[0] will be created
  + resource "azurerm_logic_app_action_custom" "welsh_send_email" {
      + body         = (sensitive value)
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + name         = "send-welsh-email"
    }

  # azurerm_logic_app_trigger_recurrence.monthly_trigger[0] will be created
  + resource "azurerm_logic_app_trigger_recurrence" "monthly_trigger" {
      + frequency    = "Month"
      + id           = (known after apply)
      + interval     = 1
      + logic_app_id = (known after apply)
      + name         = "monthly-recurrence"
      + start_time   = (known after apply)
      + time_zone    = (known after apply)
    }

  # azurerm_logic_app_trigger_recurrence.welsh_monthly_trigger[0] will be created
  + resource "azurerm_logic_app_trigger_recurrence" "welsh_monthly_trigger" {
      + frequency    = "Month"
      + id           = (known after apply)
      + interval     = 1
      + logic_app_id = (known after apply)
      + name         = "monthly-welsh-trigger"
      + time_zone    = (known after apply)

      + schedule {
          + at_these_hours   = [
              + 9,
            ]
          + at_these_minutes = [
              + 0,
            ]
        }
    }

  # azurerm_logic_app_workflow.kql_report_workflow[0] will be created
  + resource "azurerm_logic_app_workflow" "kql_report_workflow" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "xui-webapp-kql-report-prod"
      + resource_group_name             = "xui-webapp-prod"
      + tags                            = {
          + "application"         = "expert-ui"
          + "builtFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "production"
          + "managedBy"           = "Expert UI"
        }
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_logic_app_workflow.welsh_report_workflow[0] will be created
  + resource "azurerm_logic_app_workflow" "welsh_report_workflow" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "xui-webapp-welsh-report-prod"
      + resource_group_name             = "xui-webapp-prod"
      + tags                            = {
          + "application"         = "expert-ui"
          + "builtFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "production"
          + "managedBy"           = "Expert UI"
        }
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_role_assignment.logic_app_log_analytics_reader[0] will be created
  + resource "azurerm_role_assignment" "logic_app_log_analytics_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.welsh_logic_app_log_analytics_reader[0] will be created
  + resource "azurerm_role_assignment" "welsh_logic_app_log_analytics_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.redis6-cache.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpx-mc-redis6-cache-prod/providers/Microsoft.Cache/redis/xui-webapp-prod"
        name                               = "xui-webapp-prod"
        tags                               = {
            "application"         = "expert-ui"
            "builtFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#xui-pipeline"
            "environment"         = "production"
            "managedBy"           = "Expert UI"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 1330 -> 642
          ~ maxmemory_delta                         = 1330 -> 642
          ~ maxmemory_reserved                      = 1330 -> 642
            # (14 unchanged attributes hidden)
        }
    }

Plan: 17 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + logicAppTriggerName           = "monthly-recurrence"
  + logicAppWorkflowId            = (known after apply)
  + logicAppWorkflowName          = "xui-webapp-kql-report-prod"
  + welshLogicAppTriggerName      = "monthly-welsh-trigger"
  + welshLogicAppWorkflowId       = (known after apply)
  + welshLogicAppWorkflowName     = "xui-webapp-welsh-report-prod"
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":4660,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->